Repository: RuedigerVoigt/compatibility
Catalog: compatibility/locales/*/LC_MESSAGES/compatibility.po
Languages: de

source: Non-existing or incomplete date!
de: Nicht existierendes oder unvollständiges Datum!

source: date_to_coerce must be either string or datetime.date
de: date_to_coerce muss entweder string oder datetime.date sein

source: Missing package name!
de: Fehlender Paketname!

source: Missing package version!
de: Fehlende Paketversion!

source: Invalid value for language_messages!
de: Ungültiger Wert für language_messages!

source: Parameter python_version_support incomplete!
de: Parameter python_version_support unvollständig!

source: Parameter python_version_support: too many keys!
de: Parameter python_version_support: zu viele Schlüssel!

source: Parameter python_version_support contains unknown keys.
de: Parameter python_version_support enthält unbekannte Schlüssel.

source: Value for key min_version is incorrect.
de: Wert für Schlüssel min_version ist inkorrekt.

source: Value for key max_tested_version incorrect.
de: Wert für Schlüssel max_tested_version ist inkorrekt.

source: Some string in incompatible_versions cannot be parsed.
de: Eine Zeichenkette in incompatible_versions kann nicht geparst werden.

source: You use %(running)s, but need at least %(required)s to run %(package)s.
de: Sie verwenden %(running)s, benötigen aber mindestens %(required)s um %(package)s auszuführen.

source: Your version of Python is not compatible with this version of %(package)s. Please check for updates.
de: Ihre Python-Version ist nicht kompatibel mit dieser Version von %(package)s. Bitte prüfen Sie auf Updates.

source: You are running Python %s, but your version of %s is only tested up to %s. Please check for updates.
de: Sie verwenden Python %s, aber Ihre Version von %s ist nur bis %s getestet. Bitte prüfen Sie auf Updates.

source: Parameter system_support must be a dictionary
de: Parameter system_support muss ein Dictionary sein

source: Unknown key in dictionary system_support
de: Unbekannter Schlüssel im Dictionary system_support

source: Use a set to hold values for %s.
de: Verwenden Sie ein Set für die Werte von %s.

source: Invalid system in %s. Allowed: %s
de: Ungültiges System in %s. Erlaubt: %s

source: Contradiction: System cannot simultaneously be fully AND only partially supported.
de: Widerspruch: System kann nicht gleichzeitig vollständig UND nur teilweise unterstützt sein.

source: Contradiction: System cannot have full support AND be incompatible!
de: Widerspruch: System kann nicht vollständig unterstützt UND inkompatibel sein!

source: %s fully supports %s.
de: %s unterstützt %s vollständig.

source: %s has only partial support on %s.
de: %s hat nur teilweise Unterstützung für %s.

source: This version of %s is incompatible with %s!
de: Diese Version von %s ist inkompatibel mit %s!

source: %s's support for %s is unknown!
de: Die Unterstützung von %s für %s ist unbekannt!

source: You are using %(package)s %(version)s (released: %(date)s)
de: Sie verwenden %(package)s %(version)s (veröffentlicht: %(date)s)

source: Some key in nag_over_update has wrong type!
de: Ein Schlüssel in nag_over_update hat den falschen Typ!

source: nag_days_after_release must not be negative.
de: nag_days_after_release darf nicht negativ sein.

source: nag_in_hundred must be int between 0 and 100.
de: nag_in_hundred muss ein Integer zwischen 0 und 100 sein.

source: Your version of %s was released %s days ago. Please check for updates.
de: Ihre Version von %s wurde vor %s Tagen veröffentlicht. Bitte prüfen Sie auf Updates.
